In [238]:
#Importations de librairie pandas 
import pandas as pd 
import numpy as np

In [196]:
#Creations de la DataFrame 

data =pd.DataFrame({
    'Nom':['Hafidhou maoulida ','Fahami Toihir','Zayyad Said','Sayaf Hassanaly'],
    'Niveau':['Bac +5', 'Doctorat','Bac +1','Bac +2'],
    'Age':[25,30,22,21],
    'Ville':['Tsinimoipanga','Vouvouni','Mbachilé','Hetsa']
})

In [197]:
#Afficher la liste de la DataFrame
df=pd.DataFrame(data)
print(df)

                  Nom    Niveau  Age          Ville
0  Hafidhou maoulida     Bac +5   25  Tsinimoipanga
1       Fahami Toihir  Doctorat   30       Vouvouni
2         Zayyad Said    Bac +1   22       Mbachilé
3     Sayaf Hassanaly    Bac +2   21          Hetsa

In [198]:
#Afficher les premieres lignes 
print(df.head())

                  Nom    Niveau  Age          Ville
0  Hafidhou maoulida     Bac +5   25  Tsinimoipanga
1       Fahami Toihir  Doctorat   30       Vouvouni
2         Zayyad Said    Bac +1   22       Mbachilé
3     Sayaf Hassanaly    Bac +2   21          Hetsa

In [147]:
#afficher les dernieres lignes 
print(df.tail())

                  Nom    Niveau  Age          Ville
0  Hafidhou maoulida     Bac +5   25  Tsinimoipanga
1       Fahami Toihir  Doctorat   30       Vouvouni
2         Zayyad Said    Bac +1   22       Mbachilé
3     Sayaf Hassanaly    Bac +2   21          Hetsa

In [148]:
#Afficher les informations sur la DataFrame
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Nom     4 non-null      object
 1   Niveau  4 non-null      object
 2   Age     4 non-null      int64
 3   Ville   4 non-null      object
dtypes: int64(1), object(3)
memory usage: 260.0+ bytes
None

In [149]:
#Afficher des statistiques descriptives
print(df.describe())

             Age
count   4.000000
mean   24.500000
std     4.041452
min    21.000000
25%    21.750000
50%    23.500000
75%    26.250000
max    30.000000

In [150]:
#Selectionner une colonne
print(df['Nom'])

0    Hafidhou maoulida
1         Fahami Toihir
2           Zayyad Said
3       Sayaf Hassanaly
Name: Nom, dtype: object

In [151]:
#Selectionner plusieurs colonnes 
print(df[['Age','Ville']])

   Age          Ville
0   25  Tsinimoipanga
1   30       Vouvouni
2   22       Mbachilé
3   21          Hetsa

In [152]:
#Selectionner des lignes par index 
print(df.iloc[0]) #Premiere ligne

Nom       Hafidhou maoulida
Niveau                Bac +5
Age                       25
Ville          Tsinimoipanga
Name: 0, dtype: object

In [153]:
#Selectionner des lignes par index 
print(df.loc[1]) #ligne avec l'index 0

Nom       Fahami Toihir
Niveau         Doctorat
Age                  30
Ville          Vouvouni
Name: 1, dtype: object

In [154]:
#Filtrer les données
print (df[df['Age'] >= 30])

             Nom    Niveau  Age     Ville
1  Fahami Toihir  Doctorat   30  Vouvouni

Modification des données

In [157]:
#Ajouter une nouvelle colone
df['Moyenne'] =[13.85,15,14.90,16]
#print(df)
df.head()

                  Nom    Niveau  Age          Ville  Moyenne
0  Hafidhou maoulida     Bac +5   25  Tsinimoipanga    13.85
1       Fahami Toihir  Doctorat   30       Vouvouni    15.00
2         Zayyad Said    Bac +1   22       Mbachilé    14.90
3     Sayaf Hassanaly    Bac +2   21          Hetsa    16.00

In [159]:
df['Etablissement']=["Sup'management","Faculté de Kenetra","Sup'manaement","Dar'Mahrez"]
#print(df)
df.head()

,Nom,Niveau,Age,Ville,Moyenne,Etablissement
0,Hafidhou maoulida,Bac +5,25,Tsinimoipanga,13.85,Sup'management
1,Fahami Toihir,Doctorat,30,Vouvouni,15.00,Faculté de Kenetra
2,Zayyad Said,Bac +1,22,Mbachilé,14.90,Sup'manaement
3,Sayaf Hassanaly,Bac +2,21,Hetsa,16.00,Dar'Mahrez

In [ ]:
#Modifier une colonne existante
df['Age'] = df['Age'] + 1 #Ajout plus +1 l'age

In [160]:
#print (df)
df.head()

,Nom,Niveau,Age,Ville,Moyenne,Etablissement
0,Hafidhou maoulida,Bac +5,25,Tsinimoipanga,13.85,Sup'management
1,Fahami Toihir,Doctorat,30,Vouvouni,15.00,Faculté de Kenetra
2,Zayyad Said,Bac +1,22,Mbachilé,14.90,Sup'manaement
3,Sayaf Hassanaly,Bac +2,21,Hetsa,16.00,Dar'Mahrez

In [166]:
#supprimer une colonne exixtante 
df = df.drop('Etablissement', axis=5)

ValueError: No axis named 5 for object type DataFrame

In [167]:
#print(df)
df.head()

                  Nom    Niveau  Age          Ville  Moyenne
0  Hafidhou maoulida     Bac +5   25  Tsinimoipanga    13.85
1       Fahami Toihir  Doctorat   30       Vouvouni    15.00
2         Zayyad Said    Bac +1   22       Mbachilé    14.90
3     Sayaf Hassanaly    Bac +2   21          Hetsa    16.00

Gestion des valeurs manquantes

In [168]:
#Verifier les valeurs manquantes
print(df.isnull())

     Nom  Niveau    Age  Ville  Moyenne
0  False   False  False  False    False
1  False   False  False  False    False
2  False   False  False  False    False
3  False   False  False  False    False

In [172]:
#Supprimer les lignes avec des valeurs manquantes 
df =df.dropna()
df.head()

                  Nom    Niveau  Age          Ville  Moyenne
0  Hafidhou maoulida     Bac +5   25  Tsinimoipanga    13.85
1       Fahami Toihir  Doctorat   30       Vouvouni    15.00
2         Zayyad Said    Bac +1   22       Mbachilé    14.90
3     Sayaf Hassanaly    Bac +2   21          Hetsa    16.00

In [173]:
#print(df)
df.head()

                  Nom    Niveau  Age          Ville  Moyenne
0  Hafidhou maoulida     Bac +5   25  Tsinimoipanga    13.85
1       Fahami Toihir  Doctorat   30       Vouvouni    15.00
2         Zayyad Said    Bac +1   22       Mbachilé    14.90
3     Sayaf Hassanaly    Bac +2   21          Hetsa    16.00

In [174]:
#Remplacer les valeurs manquantes 
df= df.fillna(0)

In [175]:
#print (df)
df.head()

                  Nom    Niveau  Age          Ville  Moyenne
0  Hafidhou maoulida     Bac +5   25  Tsinimoipanga    13.85
1       Fahami Toihir  Doctorat   30       Vouvouni    15.00
2         Zayyad Said    Bac +1   22       Mbachilé    14.90
3     Sayaf Hassanaly    Bac +2   21          Hetsa    16.00

Agrégation et regroupement

In [176]:
#Calculer la moyenne d'une colonne
print(df['Age'].mean())

24.5

In [177]:
#Grouper par colonne et calculer des statiques
print(df.groupby('Ville')['Age'].mean())

Ville
Hetsa            21.0
Mbachilé         22.0
Tsinimoipanga    25.0
Vouvouni         30.0
Name: Age, dtype: float64

Tri des données

In [178]:
#Trier par colonne
df= df.sort_values(by='Age',ascending=False) #trier par ordre croissant 
#print(df)
df.head()

                  Nom    Niveau  Age          Ville  Moyenne
1       Fahami Toihir  Doctorat   30       Vouvouni    15.00
0  Hafidhou maoulida     Bac +5   25  Tsinimoipanga    13.85
2         Zayyad Said    Bac +1   22       Mbachilé    14.90
3     Sayaf Hassanaly    Bac +2   21          Hetsa    16.00

Exportation des données

In [179]:
#Exporter en CSV
df.to_csv('nouveau_fichier.csv', index=False)

In [180]:
#Exporter en Excel
df.to_excel('nouveau_fichier.xlsx', index=False)

Le 10-02-2025
Ajout  de nouvelles enregistrements

In [218]:
#Creeons une nouvelle lignes 
News_rows=pd.DataFrame({
             'Nom':['Samir Soule'],
             'Nivau':['Bac +3'],
             'Age':[23],
             'Ville':['Diboini'],
             'Etablissement':['Dar_Mahrez']})
              

data=data._append(News_rows,ignore_index = True) #Le "ignore_index=True" si les données sont correctes il ajout la nouvelle enregistrement a la fin
data

                   Nom    Niveau  Age          Ville   Nivau Etablissement
0   Hafidhou maoulida     Bac +5   25  Tsinimoipanga     NaN           NaN
1        Fahami Toihir  Doctorat   30       Vouvouni     NaN           NaN
2          Zayyad Said    Bac +1   22       Mbachilé     NaN           NaN
3      Sayaf Hassanaly    Bac +2   21          Hetsa     NaN           NaN
4          Samir Soule       NaN   23        Diboini  Bac +3    Dar_Mahrez
5          Samir Soule       NaN   23        Diboini  Bac +3    Dar_Mahrez
6          Samir Soule       NaN   23        Diboini  Bac +3    Dar_Mahrez
7          Samir Soule       NaN   23        Diboini  Bac +3    Dar_Mahrez
8          Samir Soule       NaN   23        Diboini  Bac +3    Dar_Mahrez
9          Samir Soule       NaN   23        Diboini  Bac +3    Dar_Mahrez
10         Samir Soule       NaN   23        Diboini  Bac +3    Dar_Mahrez

In [247]:
#Remplacer les NaN dans une colonne specifique  
df['Etablissement'].fillna('',inplace=True)
print(df)

KeyError: 'Etablissement'

In [235]:
df.drop_duplicates(subset ="Niveau", keep = 'first', inplace=True)
df.head()

                  Nom    Niveau  Age          Ville Numero téléphone
0  Hafidhou maoulida     Bac +5   25  Tsinimoipanga       0612345675
1       Fahami Toihir  Doctorat   30       Vouvouni       0649769646
2         Zayyad Said    Bac +1   22       Mbachilé       0745678765
3     Sayaf Hassanaly    Bac +2   21          Hetsa       0544349534

In [236]:
#Afficher le doublons
df.duplicated()
#df.head()

0    False
1    False
2    False
3    False
dtype: bool

In [237]:
#Verifier les valeurs manquantes
print(df.isnull())

     Nom  Niveau    Age  Ville  Numero téléphone
0  False   False  False  False             False
1  False   False  False  False             False
2  False   False  False  False             False
3  False   False  False  False             False

In [233]:
#Remplacer les valeurs manquantes 
df= df.fillna(4)
df.head()

                  Nom    Niveau  Age          Ville Numero téléphone
0  Hafidhou maoulida     Bac +5   25  Tsinimoipanga       0612345675
1       Fahami Toihir  Doctorat   30       Vouvouni       0649769646
2         Zayyad Said    Bac +1   22       Mbachilé       0745678765
3     Sayaf Hassanaly    Bac +2   21          Hetsa       0544349534

In [228]:
df =df.dropna()
df.head()

                  Nom    Niveau  Age          Ville Numero téléphone
0  Hafidhou maoulida     Bac +5   25  Tsinimoipanga       0612345675
1       Fahami Toihir  Doctorat   30       Vouvouni       0649769646
2         Zayyad Said    Bac +1   22       Mbachilé       0745678765
3     Sayaf Hassanaly    Bac +2   21          Hetsa       0544349534

In [229]:
df

                  Nom    Niveau  Age          Ville Numero téléphone
0  Hafidhou maoulida     Bac +5   25  Tsinimoipanga       0612345675
1       Fahami Toihir  Doctorat   30       Vouvouni       0649769646
2         Zayyad Said    Bac +1   22       Mbachilé       0745678765
3     Sayaf Hassanaly    Bac +2   21          Hetsa       0544349534

In [226]:
#Supprimer les doublons
df.drop_duplicates(keep = 'first', inplace=True)
df.head()

                  Nom    Niveau  Age          Ville Numero téléphone
0  Hafidhou maoulida     Bac +5   25  Tsinimoipanga       0612345675
1       Fahami Toihir  Doctorat   30       Vouvouni       0649769646
2         Zayyad Said    Bac +1   22       Mbachilé       0745678765
3     Sayaf Hassanaly    Bac +2   21          Hetsa       0544349534

In [220]:
df['Numero téléphone']=["0612345675","0649769646","0745678765","0544349534"]
#print(df)
df.head()

                  Nom    Niveau  Age          Ville Numero téléphone
0  Hafidhou maoulida     Bac +5   25  Tsinimoipanga       0612345675
1       Fahami Toihir  Doctorat   30       Vouvouni       0649769646
2         Zayyad Said    Bac +1   22       Mbachilé       0745678765
3     Sayaf Hassanaly    Bac +2   21          Hetsa       0544349534